Revit 2027 API
MasonryCMUPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "MasonryCMUPattern" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MasonryCMUPatternType
Public Enumeration MasonryCMUPatternType
public enum class MasonryCMUPatternType
type MasonryCMUPatternType
Members
Member name | Value | Description
Custom | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace